; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 310877 1 1 3 8 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	thermograph2 - mode
	image0 - mode
	spectrograph1 - mode
	GroundStation0 - direction
	Star2 - direction
	Star3 - direction
	Star4 - direction
	Star5 - direction
	GroundStation6 - direction
	GroundStation7 - direction
	GroundStation1 - direction
	Planet8 - direction
	Planet9 - direction
	Planet10 - direction
	Planet11 - direction
	Planet12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 thermograph2)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet8)
)
(:goal (and
	(have_image Planet8 image0)
	(have_image Planet9 spectrograph1)
	(have_image Planet10 image0)
	(have_image Planet11 thermograph2)
	(have_image Planet12 image0)
	(have_image Phenomenon13 thermograph2)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
2. (turn_to satellite0 groundstation1 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 6
3. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 0 of 6
4. (turn_to satellite0 planet9 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet9)
   goals met: 0 of 6
5. (take_image satellite0 planet9 instrument0 spectrograph1)
   added: (have_image planet9 spectrograph1)
   goals met: 1 of 6
6. (turn_to satellite0 planet12 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 planet12)
   goals met: 1 of 6
7. (take_image satellite0 planet12 instrument0 image0)
   added: (have_image planet12 image0)
   goals met: 2 of 6
8. (turn_to satellite0 planet11 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet11)
   goals met: 2 of 6
9. (take_image satellite0 planet11 instrument0 thermograph2)
   added: (have_image planet11 thermograph2)
   goals met: 3 of 6
10. (turn_to satellite0 planet10 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet10)
   goals met: 3 of 6
11. (take_image satellite0 planet10 instrument0 image0)
   added: (have_image planet10 image0)
   goals met: 4 of 6
12. (turn_to satellite0 phenomenon13 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon13)
   goals met: 4 of 6
13. (take_image satellite0 phenomenon13 instrument0 thermograph2)
   added: (have_image phenomenon13 thermograph2)
   goals met: 5 of 6
14. (turn_to satellite0 planet8 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 planet8)
   goals met: 5 of 6
15. (take_image satellite0 planet8 instrument0 image0)
   added: (have_image planet8 image0)
   goals met: 6 of 6
